### [ env/poc ] terraform plan
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_log_analytics_workspace.law will be created
  + resource "azurerm_log_analytics_workspace" "law" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = false
      + internet_query_enabled          = false
      + local_authentication_disabled   = false
      + location                        = "germanywestcentral"
      + name                            = "faspo-poc-law"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "faspo-poc-data-rg"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

  # azurerm_monitor_diagnostic_setting.aks-monitor will be created
  + resource "azurerm_monitor_diagnostic_setting" "aks-monitor" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "faspo-poc-aks-monitor"
      + target_resource_id             = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-comp-rg/providers/Microsoft.ContainerService/managedClusters/faspo-poc-aks"

      + enabled_log {
          + category       = "audit"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "container"
            # (1 unchanged attribute hidden)
        }
    }

  # azurerm_monitor_private_link_scoped_service.law-ampls-link will be created
  + resource "azurerm_monitor_private_link_scoped_service" "law-ampls-link" {
      + id                  = (known after apply)
      + linked_resource_id  = (known after apply)
      + name                = "faspo-poc-law-ampls-link"
      + resource_group_name = "faspo-poc-net-rg"
      + scope_name          = "faspo-poc-law-ampls"
    }

  # azurerm_private_endpoint.law-ampls-pen will be created
  + resource "azurerm_private_endpoint" "law-ampls-pen" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "faspo-poc-law-ampls-pen-nic"
      + id                            = (known after apply)
      + location                      = "germanywestcentral"
      + name                          = "faspo-poc-law-ampls-pen"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "faspo-poc-net-rg"
      + subnet_id                     = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-net-rg/providers/Microsoft.Network/virtualNetworks/faspo-poc-vnet/subnets/faspo-poc-vnet-infra-subnet"

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "faspo-poc-law-ampls-pen-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-net-rg/providers/Microsoft.Network/privateDnsZones/privatelink.monitor.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "law-ampls-pen-connection"
          + private_connection_resource_id = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-net-rg/providers/Microsoft.Insights/privateLinkScopes/faspo-poc-law-ampls"
          + private_ip_address             = (known after apply)
        }
    }

  # azurerm_role_assignment.gha-aks-rbac will be created
  + resource "azurerm_role_assignment" "gha-aks-rbac" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "cc38cf91-47db-41cc-87c6-9052cee66428"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Cluster User Role"
      + scope                            = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-comp-rg/providers/Microsoft.ContainerService/managedClusters/faspo-poc-aks"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
